---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartLayerConstruction
source: html/e1f6500c-17ab-44b0-85c6-39a89716026f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartLayerConstruction Property

"Construction"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartLayerConstruction { get; }
```